/* ====================================
  ■■■ 자바의 기본 입출력(I/O) ■■■
=======================================*/

//녹화함

/*

바이트기반 스트림 / 문자기반스트림 으로 나뉨

- 입력(input) 바이트기반 스트림(밖에 수도꼭지)  
- 입력(input) 문자기반 스트림(밖에 수도꼭지) 
- 출력(output) 바이트기반(내부에 수도꼭지)
- 출력(output) 문자기반(내부에 수도꼭지)

수제비처럼 하나씩하나씩 떼서 넣고 하나씩하나씩 나오고

임시적으로 물을 저장해놓을 수 있는 버퍼가 달려있는 스트림이있음(주사기처럼 차면 밀어놓고)
버퍼되어있는 물줄기 / 버퍼되어있지 않은 물줄기

이것도 바이트기반 스트림 / 문자기반스트림 으로 나뉨
- 입력(input) 바이트기반에 버퍼 달려있는것
- 입력(input) 문자기반에 버퍼가 달려있는것
- 출력(output) 바이트기반에 버퍼 달려있는것
- 출력(output) 문자기반에 버퍼가 달려있는것

이제 그럼 알아할 것은!!
수도꼭지 트는 방법 
수도꼭지 잠그는 방법
하나하나떠서 그스트림에 올리는 방법
스트림에 있는걸 끄집어 내는 방법
바이트기반 스트림할떼 주의할점
문자기반 스트림할떼 주의할점
이거 보면 끝

*/


public class Test168
{
	public static void main(String[] args)
	{
		
	}
}