/* =================================
■■■ 배열 ■■■
- 배열의 기본적 활용(2차원 배열)
====================================*/
/*
배열의 배열(다차원 배열)을 활용하여
다음과 같은 데이터를 요소로 취하는 배열을 구성하고
그 결과를 출력하는 프로그램을 구현한다.

 n
  ↓
   1   8   9  16  17       00 01 02 03 04 
   2   7  10  15  18       10 11 12 13 14 
   3   6  11  14  19       20 21 22 23 24 
   4   5  12  13  20       30 31 32 33 34 
    

   -> 규칙 : 짤수 홀수 나눠서 생각

   계속하려면 아무키나 누르세요...
*/

public class Test084
{
	public static void main(String[] args)
	{
		
		/*----------------------------------------------------------------------
		//[함께 푼 풀이]
		int[][] arr = new int[4][5];
		// arr.length -> 4

		int n =1;
	
		for (int i=0; i<5; i++)
		{
			for(int j=0;j<4;j++)
			{
				n++;
				if(i%2==0)
				{	
					arr[j][i]=n;            //00 -> 1       
					                        //10 -> 2
				}                           //20 -> 3
				                            //30 -> 4
				else		
				
				{
					arr[3-j][i]=n;        //(3-0)1 -> 31 -> 5
					                      //(3-1)1 -> 21 -> 6
				}                         //(3-2)1 -> 11 -> 7
			}					          //(3-3)1 -> 01 -> 8
		}                                 
		-------------------------------------------------------------------*/

		
		//[ + 8 하는 것]
		int[][] arr = new int[4][5];

		int n =1;
	
		for (int i=0; i<4; i++)
		{
			if(i%2==0)
			{
				for(int j=0;j<5;j++)
				{	
					arr[i][j]=n;
					n+=8;
				}
			}
			if(i%2==0)
			{
				for(int j=0;j<5;j++)
				{	
					arr[i][j]=n;
					n+=8;
				}
				}
		}
		

		/*----------------------------------------------------------------------
		// 배열 선언 및 메모리 할당
		int[][] arr = new int[4][5];
		int n;							//-- 배열에 넣을 수
		int plusEve=1, plusOdd=7;		//-- 짝수, 홀수일 때 각각 증가량


		
		// 배열 각 요소에 값 담아내기
		for (int i=0; i<4; i++)	
		{ 
			n = i+1;		//각 줄 첫번째에 넣을 수를 초기화

			for (int j=0; j<5; j++)
			{
				if (j==0)
					arr[i][j] = n;
				else if (j%2==0)
				{
					n += plusEve;
					arr[i][j] = n;
				}
				else
				{
					n += plusOdd;
					arr[i][j] = n;
				}
			}

			plusEve += 2;	//각 줄에 따른 증가량 변화 적용
			plusOdd -= 2;
		}
		-------------------------------------------------------------------*/


	

		for (int i=0; i<arr.length; i++)
		{
			for (int j=0; j<arr[i].length; j++)
			{
				System.out.printf("%4d",arr[i][j]);
				
			}System.out.println();

		}
	}
}
/*
   1   8   9  16  17
   2   7  10  15  18
   3   6  11  14  19
   4   5  12  13  20
계속하려면 아무 키나 누르십시오 . . .
*/