/* =================================================
■■■ 연산자(Operator) ■■■
- 비트 단위 연산자
===================================================*/
// 다른연산에 비해 비트연산은 빠르다
// 

public class Test021
{
	public static void main(String[] args)
	{
		int a = 10, b = -10;

		System.out.printf("~a : %d\n", ~a);
		System.out.printf("~b : %d\n", ~b);

	}
}

/* 실행 결과 
~a : -11
~b : 9
계속하려면 아무 키나 누르십시오 . . .
*/


/*
a = 10 -> 00001010

             ↓~a

		  11110101  -> -11  check?  -> ok~!!!
        + 00001011  =>  11
		------------------
		  00000000  -> 0   
		  

b = -10    10 -> 00001010 -> 2의 보수
                            ----------------
							1의 보수 + 1
							--------
							비트열 반전
                 11110101
				        1
				 11110110  -> -10 -> check? -> ok~!!
               + 00001010  -> 10
              --------------------
			            0
*/
